AnushaPattan/RFID-based-security-system/hardware/arduino/avr/boards.txt
##############################################################

gemma.vid.0=0x2341
gemma.pid.0=0x0c9f

gemma.name=Arduino Gemma

gemma.bootloader.low_fuses=0xF1
gemma.bootloader.high_fuses=0xD5
gemma.bootloader.extended_fuses=0xFE
gemma.bootloader.tool=avrdude
gemma.bootloader.lock_bits=
gemma.bootloader.unlock_bits=
gemma.bootloader.file=gemma/gemma_v1.hex

gemma.build.mcu=attiny85
gemma.build.f_cpu=8000000L
gemma.build.core=arduino
gemma.build.variant=gemma
gemma.build.board=AVR_GEMMA

gemma.upload.tool=avrdude
gemma.upload.maximum_size=5310

##############################################################

atmega_custom.name=Arduino Custom

atmega_custom.upload.tool=avrdude
atmega_custom.upload.protocol=arduino
atmega_custom.upload.speed=9600

atmega_custom.bootloader.tool=avrdude
atmega_custom.bootloader.unlock_bits=0x3F
atmega_custom.bootloader.lock_bits=0x0F

atmega_custom.build.mcu=atmega_custom
atmega_custom.build.f_cpu=8000000L
atmega_custom.build.board=AVR_NG
atmega_custom.build.core=arduino
atmega_custom.build.variant=standard

## Arduino Custom w/ ATmega16
## --------------------------------
atmega_custom.menu.cpu.ATmega16=ATmega16

atmega_custom.menu.cpu.ATmega16.upload.maximum_size=14336
atmega_custom.menu.cpu.ATmega16.upload.maximum_data_size=1024

atmega_custom.menu.cpu.ATmega16.bootloader.low_fuses=0xef
atmega_custom.menu.cpu.ATmega16.bootloader.high_fuses=0xc4
atmega_custom.menu.cpu.ATmega16.bootloader.file=atmega16/ATmegaBOOT_16.hex

atmega_custom.menu.cpu.ATmega16.build.mcu=atmega16

## Arduino Custom w/ ATmega8
## ------------------------------
atmega_custom.menu.cpu.atmega8=ATmega8

atmega_custom.menu.cpu.atmega8.upload.maximum_size=7168
atmega_custom.menu.cpu.atmega8.upload.maximum_data_size=1024

atmega_custom.menu.cpu.atmega8.bootloader.low_fuses=0xef
atmega_custom.menu.cpu.atmega8.bootloader.high_fuses=0xc4
atmega_custom.menu.cpu.atmega8.bootloader.file=atmega8/ATmegaBOOT_8.hex

atmega_custom.menu.cpu.atmega8.build.mcu=atmega8